app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    @projects = Project.all.reverse

INSERT INTO "projects" ("created_at", "date", "description", "img", "link1", "link1url", "link2", "link2url", "link3", "link3url", "link4", "link4url", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save